university/app/views/sections/_form.html.erb

    <%= form.label :course_id, style: "display: block" %>
    <%= form.collection_select :course_id, Course.all, :id, :short_name %>
---
SELECT "courses".* FROM "courses"

    <%= form.label :semester_id, style: "display: block" %>
    <%= form.collection_select :semester_id, Semester.all, :id, :name %>
---
SELECT "semesters".* FROM "semesters"