university/app/views/sections/_section.html.erb

    <strong>People:</strong>
    <% section.people.each do |people| %>
---
SELECT "people".* FROM "people" INNER JOIN "people_sections" ON "people"."id" = "people_sections"."person_id" WHERE "people_sections"."section_id" = ?  [["section_id", 1]]