university/app/views/people/_form.html.erb

    <%= form.label :section_id, style: "display: block" %>
    <%= form.collection_check_boxes :section_ids, Section.all, :id, :name_semester %>
---
SELECT "sections".* FROM "sections"