university/app/views/people/_person.html.erb

SELECT "sections".* FROM "sections" INNER JOIN "people_sections" ON "sections"."id" = "people_sections"."section_id" WHERE "people_sections"."person_id" = ?  [["person_id", 1]]
---
    <strong>Sections:</strong>
    <% person.sections.each do |section| %>