university/app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (name like '%calc%')
SELECT "courses".* FROM "courses"
---
  def index
    if params[:query]
      @courses = Course.where("name like ?", "%#{params[:query]}%")
    else
      @courses = Course.all

INSERT INTO "courses" ("name", "course", "prefix_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["course", 1], ["prefix_id", 980190962], ["created_at", "2022-11-07 04:58:45.090664"], ["updated_at", "2022-11-07 04:58:45.090664"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 980190962]]
---
  def destroy
    @course.destroy