university/app/controllers/prefixes_controller.rb

SELECT "prefixes".* FROM "prefixes"
---
  def index
    if params[:query]
      @prefixes = Prefix.where("name like ?", "%#{params[:query]}%")
    else
      @prefixes = Prefix.all

INSERT INTO "prefixes" ("prefix", "created_at", "updated_at") VALUES (?, ?, ?)  [["prefix", "MTH"], ["created_at", "2022-11-07 04:58:45.199017"], ["updated_at", "2022-11-07 04:58:45.199017"]]
---
  def create
    @prefix = Prefix.new(prefix_params)

    respond_to do |format|
      if @prefix.save

DELETE FROM "prefixes" WHERE "prefixes"."id" = ?  [["id", 980190962]]
---
  def destroy
    @prefix.destroy

SELECT "prefixes".* FROM "prefixes" WHERE "prefixes"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_prefix
      @prefix = Prefix.find(params[:id])