university/app/controllers/sections_controller.rb

  def index
    if params[:query]
      @sections = Section.where("section like ?", "%#{params[:query]}%")
    else
      @sections = Section.all
---
SELECT "sections".* FROM "sections" WHERE (section like '%1%')
SELECT "sections".* FROM "sections"

  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save
---
INSERT INTO "sections" ("section", "crn", "course_id", "semester_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["section", 1], ["crn", 1], ["course_id", 980190962], ["semester_id", 980190962], ["created_at", "2022-11-07 04:58:45.174890"], ["updated_at", "2022-11-07 04:58:45.174890"]]

  def destroy
    @section.destroy
---
DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 980190962]]

    def set_section
      @section = Section.find(params[:id])
---
SELECT "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]