university/app/controllers/semesters_controller.rb

  def index
    if params[:query]
      @semesters = Semester.where("year like ?", "%#{params[:query]}%")
    else
      @semesters = Semester.all
---
SELECT "semesters".* FROM "semesters" WHERE (year like '%2023%')
SELECT "semesters".* FROM "semesters"

  def create
    @semester = Semester.new(semester_params)

    respond_to do |format|
      if @semester.save
---
INSERT INTO "semesters" ("semester", "year", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["semester", "Fall"], ["year", 2022], ["created_at", "2022-11-07 04:30:12.231645"], ["updated_at", "2022-11-07 04:30:12.231645"]]

  def destroy
    @semester.destroy
---
DELETE FROM "semesters" WHERE "semesters"."id" = ?  [["id", 3]]

  def set_semester
    @semester = Semester.find(params[:id])
---
SELECT "semesters".* FROM "semesters" WHERE "semesters"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]