university/app/views/courses/_course.html.erb

    <strong>Sections:</strong>
    <% course.sections.each do |section| %>
---
SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = ?  [["course_id", 1]]